import streamlit as st
import os

st.set_page_config(page_title="เมนูวันนี้ จากวัตถุดิบที่มี", layout="wide")

# =========================
# 📦 DATA
# =========================
RECIPES = [
    {
        "id": 1,
        "name": "ต้มข่าไก่",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ต้มข่าไก่.jpg",
        },
        "type": "ต้ม",
        "difficulty": "ยาก",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 2,
        "name": "ไก่ต้มสมุนไพร",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "พริกไทย",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกขี้หนู",
            "ผักชี",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ไก่ต้มสมุนไพร.jpg",
        },
        "type": "ต้ม",
        "difficulty": "กลาง",
        "time": "30-50",
        "steps": [
            "เตรียมสมุนไพร หั่นตะไคร้เป็นท่อน หั่นข่าเป็นแว่น หั่นหอมแดงเป็นชิ้น ใบมะกรูดฉีกและซอยสำหรับโรย1-2ใบ",
            "นำสมุนไพรทั้งหมดไปปั่นรวมกับพริก พริกไทย กระเทียม ใส่น้ำเล็กน้อยปั่นให้ละเอียด",
            "ตั้งหม้อต้มน้ำให้เดือด ใส่ส่วนผสมที่ปั่นไว้ลงไป ใส่เนื้อไก่ลงไปต้ม",
            " ปรุงรสตามชอบด้วยน้ำปลา ซอสหอยนางรม ผงปรุงรส น้ำตาล",
            "ต้มด้วยไฟกลางประมาณ 40 นาทีให้เปื่อย ",
            "ใส่ใบมะกรูดที่ซฮยไว้ลงไปต้มต่ออีก10นาที ปิดไฟพร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 3,
        "name": "แกงส้มชะอมไข่",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/แกงส้มชะอมไข่.jpg",
        },
        "type": "แกง",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 4,
        "name": "น้ำพริกหนุ่ม",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกหนุ่ม.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "กลาง",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 5,
        "name": "น้ำเงี้ยวปลากระป๋อง",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำเงี้ยวปลากระป๋อง.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 6,
        "name": "ไข่ผัดแหนม",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ไข่ผัดแหนม.jpg",
        },
        "type": "ผัด",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 7,
        "name": "ข้าวมันไก่",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ข้าวมันไก่.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "กลาง",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 8,
        "name": "ลาบวุ้นเส้น",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ลาบวุ้นเส้น.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 9,
        "name": "กะเพราวุ้นเส้นหมูสับ",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/กะเพราวุ้นเส้นหมูสับ.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 10,
        "name": "แกงกะหรี่ญี่ปุ่น",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/แกงกะหรี่ญี่ปุ่น.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
#    {
#          "id": 11,
#          "name": "เห็ดเข็มทองผัดหม่าล่าใส่หมูสามชั้น",
#           "base_ingredients": [
#           "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
#            "ข่า",
#            "น้ำมะขามเปียก",
#            "กะทิ",
#            "ตะไคร้",
#            "ใบมะกรูด",
#            "หอมแดง",
#            "พริกชี้ฟ้า",
#            "ผักชี",
#            "เห็ดฟาง",
#        ],
#        "protein_options": [],
#        "images": {
#            "default": "image/ต้มข่าไก่.jpg",
#        },
#        "type": "น้ำพริก",
#        "difficulty": "ยาก",
#        "time": "15–30",
#        "steps": [
#            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
#            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
#            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
#            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
#        ],
#    },
    {
        "id": 12,
        "name": "น้ำพริกอ่อง",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกอ่อง.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "'ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 13,
        "name": "หลนเต้าเจี้ยวหมูสับ",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/หลนเต้าเจี้ยวหมูสับ.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ยาก",
        "time": "20-40",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 14,
        "name": "น้ำพริกกะปิปลาทู",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกกะปิปลาทู.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ยาก",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 15,
        "name": "น้ำพริกปลาดุกย่าง",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกปลาดุกย่าง.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "'ง่าย",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 16,
        "name": "น้ำพริกปลาดุกต้ม",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกปลาดุกต้ม.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "20-30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 17,
        "name": "น้ำพริกปลากะป๋อง",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกปลากะป๋อง.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "20-30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 18,
        "name": "ยำหน่อไม้",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ยำหน่อไม้.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "กลาง",
        "time": "15–30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 19,
        "name": "ยำปลากระป๋อง",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/ยำปลากระป๋อง.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "10-20",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
    {
        "id": 20,
        "name": "น้ำพริกอมะเขือ",
        "base_ingredients": [
            "เนื้อไก่ (ส่วนที่ชอบ เช่น อกไก่ สะโพก น่องไก่ ฯลฯ)",
            "ข่า",
            "น้ำมะขามเปียก",
            "กะทิ",
            "ตะไคร้",
            "ใบมะกรูด",
            "หอมแดง",
            "พริกชี้ฟ้า",
            "ผักชี",
            "เห็ดฟาง",
        ],
        "protein_options": [],
        "images": {
            "default": "image/น้ำพริกอมะเขือ.jpg",
        },
        "type": "น้ำพริก",
        "difficulty": "ง่าย",
        "time": "20-30",
        "steps": [
            "ต้มน้ำ ใส่ข่า ตะไคร้ ใบมะกรูด และพริก รอจนเดือดและหอม",
            "ใส่เนื้อไก่ลงไป ต้มจนเดือดอีกครั้ง",
            "ลดไฟลง ปรุงรสด้วยน้ำปลา น้ำตาล และน้ำมะขามเปียก ชิมรสตามชอบ",
            "ใส่กะทิลงไป ตามด้วยเห็ด ต้มจนเดือดแล้วปิดไฟ พร้อมเสิร์ฟ",
        ],
    },
]

START_ING = [
    "หมู","ไก่","ไข่","เห็ดเข็มทอง","ผักกาด","ข้าว","เต้าหู้","กุ้ง","ปลา","วุ้นเส้น","มะนาว",
    "ตะไคร้","ขิง","ตับไก่","ตับหมู","กะทิ","มะเขือเทศ","มะเขือเปราะ","กระเพรา","พริก","กระเทียม",
    "โหรพา","หอมหัวใหญ่","แครอท","ถั่วฝักยาว","หอมแดง","ใบมะกรูด","พริกแห้ง","ผักคะน้า","ผักบุ้ง",
    "แตงกวา","กระชาย","ฟักทอง","มันฝรั่ง","มะเขือยาว","สะตอ","ผักหวาน","กระเจี๊ยบเขียว",
    "พริกหวาน","นมจืด","พริกหยวก","พริกหนุ่ม"
]

# =========================
# 🧠 SESSION STATE
# =========================
if "ingredients" not in st.session_state:
    st.session_state.ingredients = set(START_ING)

if "selected" not in st.session_state:
    st.session_state.selected = set()

if "filters" not in st.session_state:
    st.session_state.filters = {"type": "", "difficulty": "", "time": ""}

if "name_query" not in st.session_state:
    st.session_state.name_query = ""

# =========================
# 🖼 IMAGE HELPER (กันรูปพัง)
# =========================
def safe_image(path: str):
    if not path:
        return None
    if path.startswith("http"):
        return path
    if os.path.exists(path):
        return path
    return None

def get_recipe_image(recipe):
    selected = st.session_state.selected
    for protein in recipe.get("protein_options", []):
        if protein in selected:
            return safe_image(recipe["images"].get(protein))
    return safe_image(recipe["images"].get("default"))

# =========================
# 🎯 MATCH LOGIC
# =========================
def matches(recipe):
    f = st.session_state.filters
    selected = st.session_state.selected

    if f["type"] and recipe["type"] != f["type"]:
        return False
    if f["difficulty"] and recipe["difficulty"] != f["difficulty"]:
        return False
    if f["time"] and recipe["time"] != f["time"]:
        return False

    if st.session_state.name_query:
        q = st.session_state.name_query.lower()
        searchable = (
            [recipe["name"]]
            + recipe.get("base_ingredients", [])
            + recipe.get("protein_options", [])
        )
        if not any(q in s.lower() for s in searchable):
            return False

    selected_base = [
        s for s in selected if s not in recipe.get("protein_options", [])
    ]
    selected_protein = [
        s for s in selected if s in recipe.get("protein_options", [])
    ]

    base_match = all(
        any(sb.lower() in ing.lower() for ing in recipe["base_ingredients"])
        for sb in selected_base
    )

    if recipe.get("protein_options"):
        protein_match = (
            True if not selected_protein
            else any(p in recipe["protein_options"] for p in selected_protein)
        )
    else:
        protein_match = True

    return base_match and protein_match

# =========================
# ⭐ MATCH SCORE
# =========================
def match_score(recipe):
    selected = st.session_state.selected
    if not selected:
        return 0

    all_ings = (
        recipe.get("base_ingredients", [])
        + recipe.get("protein_options", [])
    )

    match_count = sum(
        1 for sel in selected
        if any(sel.lower() in ing.lower() for ing in all_ings)
    )

    return match_count / len(selected)

# =========================
# 🎨 UI
# =========================
st.title("🍽️ เมนูวันนี้ จากวัตถุดิบที่มี")

search_val = st.text_input("พิมพ์ชื่อเมนูหรือวัตถุดิบ")
st.session_state.name_query = search_val.lower() if search_val else ""

col_sidebar, col_main = st.columns([1, 3])

# =========================
# 🧺 SIDEBAR
# =========================
with col_sidebar:
    st.subheader("วัตถุดิบ")

    sorted_ings = sorted(list(st.session_state.ingredients))
    selected_ings = st.multiselect(
        "เลือกวัตถุดิบ",
        sorted_ings,
        default=list(st.session_state.selected),
        label_visibility="collapsed",
    )
    st.session_state.selected = set(selected_ings)

    st.divider()
    st.subheader("ตัวกรอง")

    st.session_state.filters["type"] = st.selectbox(
        "ประเภทอาหาร", ["", "ต้ม", "ผัด", "แกง", "ทอด", "ยำ", "นึ่ง","น้ำพริก"]
    )

    col_diff, col_time = st.columns(2)

    with col_diff:
        st.session_state.filters["difficulty"] = st.selectbox(
            "ระดับความยาก", ["", "ง่าย", "กลาง", "ยาก"]
        )

    with col_time:
        st.session_state.filters["time"] = st.selectbox(
            "เวลา", ["", "<15", "15–30", ">30"]
        )

# =========================
# 🍽 MAIN
# =========================
with col_main:
    filtered = [r for r in RECIPES if matches(r)]
    results = sorted(filtered, key=lambda r: match_score(r), reverse=True)

    st.subheader(f"ผลลัพธ์สูตร ({len(results)} รายการ)")

    if not results:
        st.info("ไม่พบสูตรที่ตรงกับเงื่อนไข")

    cols = st.columns(3)
    for idx, recipe in enumerate(results):
        with cols[idx % 3]:
            with st.container(border=True):

                img = get_recipe_image(recipe)
                if img:
                    st.image(img, width="stretch")
                else:
                    st.warning("⚠️ ไม่พบรูปภาพ")

                st.subheader(recipe["name"])
                st.caption(f"{recipe['type']} · {recipe['time']}")

                with st.expander("📖 วิธีทำ"):
                    for i, step in enumerate(recipe.get("steps", []), start=1):
                        st.write(f"{i}. {step}")

                score = match_score(recipe)
                if st.session_state.selected:
                    st.progress(score)
                    st.caption(f"ตรงวัตถุดิบ {score*100:.0f}%")
